In [ ]:
import re
from datetime import datetime

import pandas as pd
from pandas import DataFrame

In [ ]:
# print(type(re))
# print(type(datetime))
# print('---------------')
# print(type(pd))
# print(type(DataFrame))

<class 'module'>
<class 'type'>
---------------
<class 'module'>
<class 'type'>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
df = pd.read_csv('/content/drive/MyDrive/archive/marketing_data.csv')

In [ ]:
df.head()

      ID  Year_Birth   Education  ... Response Complain  Country
0   1826        1970  Graduation  ...        1        0       SP
1      1        1961  Graduation  ...        1        0       CA
2  10476        1958  Graduation  ...        0        0       US
3   1386        1967  Graduation  ...        0        0      AUS
4   5371        1989  Graduation  ...        1        0       SP

[5 rows x 28 columns]

In [ ]:
df.info()

In [ ]:
df.isnull().sum()

In [ ]:
# df[df['Income'].isnull() == True]

In [ ]:
column_names = df.columns
column_names

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', ' Income ',
       'Kidhome', 'Teenhome', 'Dt_Customer', 'Recency', 'MntWines',
       'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Response', 'Complain', 'Country'],
      dtype='object')

In [ ]:
df.columns = df.columns.str.strip()
df.head()

In [ ]:
df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Response', 'Complain', 'Country'],
      dtype='object')

In [ ]:
df[df['Income'].isnull() == True]

In [ ]:
to_replace = [re.findall(r'Mnt.+', name)[0] # para extraer el elemento de nuestra lista
              for name in column_names
              if 'Mnt' in name]
to_replace

['MntWines',
 'MntFruits',
 'MntMeatProducts',
 'MntFishProducts',
 'MntSweetProducts',
 'MntGoldProds']

In [ ]:
categories = [re.findall(r'(?<=Mnt).+', name)[0]
              for name in column_names 
              if 'Mnt' in name]
categories

In [ ]:
new_name_list = ['Amount_spent_in_'+name for name in categories]
new_name_list

In [ ]:
dict_names = dict(zip(to_replace, new_name_list))
dict_names

In [ ]:
df.rename(columns=dict_names, inplace=True)

In [ ]:
df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'Amount_spent_in_Wines',
       'Amount_spent_in_Fruits', 'Amount_spent_in_MeatProducts',
       'Amount_spent_in_FishProducts', 'Amount_spent_in_SweetProducts',
       'Amount_spent_in_GoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Response', 'Complain', 'Country'],
      dtype='object')

In [ ]:
# definir una funcion donde limpiemos los nombres de columna

def clean_columns(df):
  """
  Function that receives a DataFrame 
  and cleans some column names.
   
  Return a DF.
  """
  column_names = df.columns
  df.columns = df.columns.str.strip()
  to_replace = [re.findall(r'Mnt.+', name)[0] for name in column_names
                                              if 'Mnt' in name]
  categories = [re.findall(r'(?<=Mnt).+', name)[0] for name in column_names 
                                              if 'Mnt' in name]
  new_name_list = ['Amount_spent_in_'+ name for name in categories]
  dict_names = dict(zip(to_replace, new_name_list))
  df = df.rename(columns=dict_names)

  return df

In [ ]:
df_columns_clean = clean_columns(df, regex_pattern = r'Num.+')

In [ ]:
df_columns_clean.head()

      ID  Year_Birth   Education  ... Response Complain  Country
0   1826        1970  Graduation  ...        1        0       SP
1      1        1961  Graduation  ...        1        0       CA
2  10476        1958  Graduation  ...        0        0       US
3   1386        1967  Graduation  ...        0        0      AUS
4   5371        1989  Graduation  ...        1        0       SP

[5 rows x 28 columns]

In [ ]:
df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'Amount_spent_in_Wines',
       'Amount_spent_in_Fruits', 'Amount_spent_in_MeatProducts',
       'Amount_spent_in_FishProducts', 'Amount_spent_in_SweetProducts',
       'Amount_spent_in_GoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Response', 'Complain', 'Country'],
      dtype='object')

In [ ]:
datetime.now().year

2021

In [ ]:
df['customer_age'] = datetime.now().year - df['Year_Birth']

In [ ]:
df.head(2)

     ID  Year_Birth   Education  ... Complain Country  customer_age
0  1826        1970  Graduation  ...        0      SP            51
1     1        1961  Graduation  ...        0      CA            60

[2 rows x 29 columns]

In [ ]:
df['Education'].unique()

array(['Graduation', 'PhD', '2n Cycle', 'Master', 'Basic'], dtype=object)

In [ ]:
def encode_education(var):

  if var == 'Basic':
    return 0
  elif var == 'Graduation':
    return 1
  elif var == 'Master':
    return 2
  elif var == '2n Cycle':
    return 3
  elif var == 'PhD':
    return 4

In [ ]:
df['Education_encoded'] = df['Education'].apply(encode_education)

In [ ]:
df.tail(5)

         ID  Year_Birth   Education  ... Country customer_age  Education_encoded
2235  10142        1976         PhD  ...      US           45                  4
2236   5263        1977    2n Cycle  ...      SP           44                  3
2237     22        1976  Graduation  ...      SP           45                  1
2238    528        1978  Graduation  ...     IND           43                  1
2239   4070        1969         PhD  ...      CA           52                  4

[5 rows x 30 columns]

In [ ]:
df['Income'] = df['Income'].apply(lambda x: re.sub(r'[$,]', '', str(x)))

In [ ]:
df.head()

      ID  Year_Birth   Education  ... Country customer_age  Education_encoded
0   1826        1970  Graduation  ...      SP           51                  1
1      1        1961  Graduation  ...      CA           60                  1
2  10476        1958  Graduation  ...      US           63                  1
3   1386        1967  Graduation  ...     AUS           54                  1
4   5371        1989  Graduation  ...      SP           32                  1

[5 rows x 30 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 30 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   ID                             2240 non-null   int64
 1   Year_Birth                     2240 non-null   int64
 2   Education                      2240 non-null   object
 3   Marital_Status                 2240 non-null   object
 4   Income                         2240 non-null   object
 5   Kidhome                        2240 non-null   int64
 6   Teenhome                       2240 non-null   int64
 7   Dt_Customer                    2240 non-null   object
 8   Recency                        2240 non-null   int64
 9   Amount_spent_in_Wines          2240 non-null   int64
 10  Amount_spent_in_Fruits         2240 non-null   int64
 11  Amount_spent_in_MeatProducts   2240 non-null   int64
 12  Amount_spent_in_FishProducts   2240 non-null   int64
 13  Amount_spent_in_SweetProducts  2240 non-null   int64
 14  Amount_spent_in_GoldProds      2240 non-null   int64
 15  NumDealsPurchases              2240 non-null   int64
 16  NumWebPurchases                2240 non-null   int64
 17  NumCatalogPurchases            2240 non-null   int64
 18  NumStorePurchases              2240 non-null   int64
 19  NumWebVisitsMonth              2240 non-null   int64
 20  AcceptedCmp3                   2240 non-null   int64
 21  AcceptedCmp4                   2240 non-null   int64
 22  AcceptedCmp5                   2240 non-null   int64
 23  AcceptedCmp1                   2240 non-null   int64
 24  AcceptedCmp2                   2240 non-null   int64
 25  Response                       2240 non-null   int64
 26  Complain                       2240 non-null   int64
 27  Country                        2240 non-null   object
 28  customer_age                   2240 non-null   int64
 29  Education_encoded              2240 non-null   int64
dtypes: int64(25), object(5)
memory usage: 525.1+ KB